package simple;
import org.junit.Test;

/********************************
 *	프로젝트 : VisualFxVoEditor
 *	패키지   :
 *	작성일   : 2016. 5. 3.
 *	작성자   : KYJ
 *******************************/

/***************************
 *
 * @author KYJ
 *
 ***************************/
public class ByteLenthTest {

	
	
	/*
	종류       설명              저장 공간    값의 범위 (최소값~최대값)
	======================================================================================
	boolean    논리값            1 bit        true / false
	--------------------------------------------------------------------------------------
	byte       부호 있는 정수    8 bits       -128 ~ 127
	--------------------------------------------------------------------------------------
	char       유니코드 문자     16 bits      \u0000 ~ \uFFFF
	--------------------------------------------------------------------------------------
	short      부호 있는 정수    16 bits      -32768 ~ 32767
	--------------------------------------------------------------------------------------
	int        부호 있는 정수    32 bits      -2147483648 ~ 2147483647
	--------------------------------------------------------------------------------------
	long       부호 있는 정수    64 bits      -9223372036854775808 ~ 9223372036854775807
	--------------------------------------------------------------------------------------
	float      IEEE 754 실수     32 bits      1.40239846E-45f
	                                          ~ (표현 가능 양수 범위)
	                                          3.40282347E+38f
	--------------------------------------------------------------------------------------
	double     IEEE 754 실수     64 bits      4.94065645841246544E-324
	                                          ~ (표현 가능 양수 범위)
	                                          1.79769313486231570E+308
	*/
	@Test
	public void simple() {
		//문자열의 바이트 크기

		System.out.println("한 : " + "한".getBytes().length);
		System.out.println("A : " + "A".getBytes().length);
		System.out.println("a : " + "a".getBytes().length);
		System.out.println("1 : " + "1".getBytes().length);
		System.out.println("aa : " + "aa".getBytes().length);
		System.out.println("한글 : " + "한글".getBytes().length);

	}
}
